#### BuiltInFailures.SlantedColumnFailures Members

---

|  |
| --- |
| BuiltInFailures SlantedColumnFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures SlantedColumnFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | CannotCutParallelToLocationCurve | Cut plane of slanted column end is parallel to the location curve. |
| Public property Static member | SlantedColumnCannotCutEnd | Unable to trim slanted column end geometry to desired condition. |
| Public property Static member | SlantedColumnCannotCutEndWarn | Unable to trim slanted column end geometry to desired condition. |

# See Also

BuiltInFailures SlantedColumnFailures Class

Autodesk.Revit.DB Namespace